of-6/OpenFOAM-6-master/tutorials/lagrangian/reactingParcelFoam/verticalChannel/constant/reactions
species
(
    air
    H2O
);

reactions
{}
